using System;

namespace Work.Csharp
{
	class MainClass
	{
		public static void Main (string[] args)
		{
			//Console.WriteLine ("Hello World!");
//			Задачи:модул02, видео07
//			1.	Да се напише програма, която създава масив с 20 елемента от целочислен тип и 
//			инициализира всеки от елементите със стойност равна на индекса на елемента, умножен по 5. 
//			Елементите на масива да се изведат на конзолата. (Hint: Използвайте масив int[] и for цикъл.)
			int [] masive1 = new int[20];
			masive1 [0] += 1 * 5;
			for (int masive1 = 0; masiv1<= 20; masiv1 = masiv1 * 5);


			Console.WriteLine (masive1);
				
//			2.	Да се напише програма, която чете два масива от конзолата и прове¬рява дали са еднакви. 
//			(Hint: Два масива са еднакви, когато имат еднаква дължина и стойностите на елементите в тях съответно съвпадат.)
//			3.	Да се провери дали един масив е симетричен. 
//			(Hint: За да проверим дали масивът е симетричен, трябва да го обходим само до средата.
//				Тя е елементът с индекс array.length / 2. 
//				При нечетна дължина на масива този индекс е средният елемент, 
//				а при четна – елементът вляво от средата, понеже средата е между два елемента.)
//			4.	Да се дефинира масив, като стойностите да се прочитат от командния ред. 
//			След това тези стойности в масива да се изведат в обратен ред

		}
	}
}
